<preface id="preface">
 <title>Pref&aacute;cio</title>
 <sect1 id="set.intro">
  <title>Introdu&ccedil;&atilde;oo ao Manual</title>
  <simpara>
   Este manual esta&aacute; dividido em duas partes principais
  </simpara>
  <simpara>
   A primeira parte &eacute; o <link linkend="userguide">Guia do usu&aacute;rio</link>.
   Ele discorre sobre conceitos por tr&aacute;s da cria&ccedil;&atilde;o de aplica&ccedil;&otilde;es gr&aacute;ficas
   (Graphical User Interface) (<acronym>GUI</acronym>).
   A segunda parte &eacute; a <link linkend="reference">Se&ccedil;&atilde;o de Refer&ecirc;ncia</link> section. 
   Esta parte do manual fala sobre cada um dos objetos GTK, individualmente,
   os m&eacute;todos e os sinais que podem ser usados com eles.
  </simpara>
 </sect1>

 <sect1 id="about">
  <title>Sobre o Manual</title>
  <simpara>
   Este manual est&aacute; sendo escrito utilizando uma vers&atilde;o modificada do Docbook DTD.
   As modifica&ccedil;&otilde;es que tem sido feitas permitem a documenta&ccedil;&atilde;o do sistema
   de objetos usando pelo PHP-GTK. O xml b&aacute;sico para cada uma das classes e
   seus m&eacute;todos &eacute; gerada automaticamente do c&oacute;digo-fonte do PHP-GTK. Veja que
   n&atilde;o &eacute; poss&iacute;vel gerar informa&ccedil;&otilde;es de sinais desta maneira, i.e. Se n&atilde;o h&aacute;
   acompanhamento de descri&ccedil;&atilde;o textual, ent&atilde;o a informa&ccedil;&atilde;o do sinal &eacute; de fato
   incompleta para a classe.
  </simpara>
  <para>
   O gerador XML foi escrito por &link.andrei;, o autor original do
   PHP-GTK.  A documenta&ccedil;&atilde;o &eacute; transformada do c&oacute;digo-fonte XML em
   varios outros formatos usando <acronym>XSL</acronym> t&atilde;o bem quanto
   outras ferramentas.
  </para>
  <para>
   O sistema de cria&ccedil;&atilde;o de manuais foi criado e &eacute; mantido por &link.jmoore;.
  </para>
  <!-- TODO  Make sure to keep the next paragraph updated - sf -->
  <para>
   O manual est&aacute; atualmente dispon&iacute;vel em texto puro, HTML simples ou outros
   formatos HTML, todos estes dispon&iacute;vels para download em
   <ulink url="&url.phpgtk;">PHP-GTK website</ulink>.
  </para>
 </sect1>
</preface>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
sgml-parent-document:nil
sgml-default-dtd-file:"dbxml/phpgtkdoc.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->
