<?xml version="1.0" encoding="ISO-8859-1" ?>
<preface id="preface">
 <title>Pref&aacute;cio</title>
 <sect1 id="set.intro">
  <title>Introdu&ccedil;&atilde;o ao Manual</title>
  <simpara>
   Este manual est&aacute; dividido em duas partes principais:
  </simpara>
  <simpara>
   A primeira parte &eacute; o <link linkend="userguide">Guia do usu&aacute;rio</link>.
   Nesta parte voc&ecirc; obter&aacute; os conceitos por tr&aacute;s da cria&ccedil;&atilde;o de aplica&ccedil;&otilde;es Graphical User Interface (GUI).
   A segunda parte &eacute; um <link linkend="referen">Guia de Refer&ecirc;ncia</link>.
   Esta parte do manual descreve em detalhes cada objeto do GTK e os m&eacute;todos e sinais individuais  que 
   podem ser usados com ele.
  </simpara>
 </sect1>

 <sect1 id="about">
  <title>Sobre o Manual</title>
  <simpara>
   Este manual &eacute; escrito usando uma vers&atilde;o modificada do Docbook DTD.
   As modifica&ccedil;&otilde;es que tem sido feitas permitem a documenta&ccedil;&atilde;o dos
   objetos usados pelo PHP-GTK. O XML b&aacute;sico para cada uma das classes e
   seus respectivos m&eacute;todos s&atilde;o gerados automaticamente do c&oacute;digo-fonte do
   PHP-GTK. Note que n&atilde;o &eacute; poss&iacute;vel gerar informa&ccedil;&otilde;es de sinais desta maneira,
   i.e. Se n&atilde;o h&aacute; acompanhamento de descri&ccedil;&atilde;o textual, ent&atilde;o a informa&ccedil;&atilde;o do sinal
   de fato incompleta para a classe.
  </simpara>
  <para>
   O gerador XML foi escrito por &link.andrei;, o criador do PHP-GTK. A documenta&ccedil;&atilde;o
   &eacute; transformada dos fontes XML para v&aacute;rios oturos formatos usando o <acronym>XSL</acronym> 
   como uma das ferramentas do servidor.
  </para>
  <para>
   O sistema de cria&ccedil;&atilde;o dos manuais foi criado e &eacute; mantido por &link.jmoore;.
  </para>
  <!-- TODO  Make sure to keep the next paragraph updated - sf -->
  <para>
   O manual está atualmente disponível em texto puro, HTML ou outros formatos HTML, todos estes
   formatos estão disponíveis para download em <ulink url="&url.phpgtk;">PHP-GTK website</unlik>.
  </para>
 </sect1>
</preface>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
sgml-parent-document:nil
sgml-default-dtd-file:"dbxml/phpgtkdoc.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->
