<chapter id="intro">
 <title>Introduction &agrave; PHP-GTK</title>

 <sect1 id="intro.intro">
  <title>Introduction</title>
  <simpara>
   Cette partie du manuel va vous montrer les principaux concepts de la 
	 programmation PHP-GTK.
  </simpara>
 </sect1>

 <sect1 id="intro.whatis.phpgtk">
  <title>Qu'est-ce que PHP-GTK?</title>
  <simpara>
   PHP-GTK est une extensions de <ulink url="&url.php;">PHP</ulink> qui permet
   d'&eacute;crire des applications cot&eacute; client, ces applications sont graphiques et 
	 multi-plateformes. C'est la premi&egrave;re extension de ce type pour 
   <ulink url="&url.php;">PHP</ulink>  et elle a &eacute;t&eacute; ecrit pour prouver que 
	 <ulink url="&url.php;">PHP</ulink> est un langage &agrave; part enti&egrave;re et qu'il 
	 n'est pas seulement utilisable dans des applications de type Web.
  </simpara>
  <simpara>
   <emphasis>Attention</emphasis> cette extension ne permet pas d'afficher des 
	 applications and un navigateur Web. Elle permet uniquement de cr&eacute;er des 
	 applications graphiques comme vous utilisez chaque jour sur votre ordinateur
	 personnel.
  </simpara>
 </sect1>

 <sect1 id="intro.whatis.gtk">
  <title>Qu'est-ce que GTK+?</title>
  <sect2 id="intro.whatis.gtk.history">
   <title>l'Historique de GTK+</title>
   <para>
    GTK+ a &eacute;t&eacute; d&eacute;veloppe &agrave; l'origine pour <ulink url="&url.gimp;">GIMP</ulink>, 
    le <ulink url="&url.gnu;">GNU</ulink> Image Manipulation Program. 
    GTK+ signifie 'GIMP Tool Kit'. GTK+ est de plus en plus utilis&eacute; et il est 
		maintenant devenu la partie centrale de<ulink url="&url.gnome;">Gnome</ulink>,
		l'environnement graphique du projets GNU.  GTK+ a aussi et&eacute; port&eacute; sur BeOS 
		et Windows, ce qui fait de cette librairie un excellent choix pour en faire 
		une extension PHP. Cela permettra de cr&eacute;er un environnement pour d&eacute;velopper 
		des applications graphiques en PHP et ainsi profiter de la portabilit&eacute; de PHP
		sur Linux, BeOS and Windows.
   </para>
  </sect2>
  <sect2 id="intro.whatis.gtk.whatitdoes">
   <title>Qu'est ce que GTK+ est capable de faire ?</title>
   <simpara>
    GTK+ est un ensemble de librairie ecrite en C qui permette de cr&eacute;er des 
		interfaces utilisateur graphiques. Ces librairies sont d&eacute;velopp&eacute;s en Objet
   </simpara>
   <para>
    <itemizedlist>
     <listitem>
      <simpara>
       <emphasis>GLib</emphasis>
      </simpara>
      <simpara>
       permet d'acc&eacute;der &agrave; divers outils utils pour la programmation GTK+.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       <emphasis>GDK</emphasis>
      </simpara>
      <simpara>
       permet la programmation bas niveau des fonctions de dessin sur les fenetres.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       <emphasis>GTK</emphasis>
      </simpara>
      <simpara>
       donne acc&eacute;s &agrave; un certains d'objet graphiques (widgets) qui permette la 
			 programmation des interfaces utilisateurs.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
  </sect2>
 </sect1>

 <sect1 id="intro.whatis.php">
  <title>Qu'est ce que PHP?</title>
  <sect2 id="intro.whatis.php.history">
   <title>l'Historique de PHP</title>
   <simpara>
    <ulink url="&url.php;">PHP</ulink> est n&eacute;e en tant que langage de script 
		cot&eacute; serveur inclus dans le HTML et c'est dans cette discipline qu'il excelle
   </simpara>
   <simpara>
    PHP, signifiait &agrave; l'origine "Personal Home Pages", a &eacute;t&eacute; con&ccedil;u durant l'automne 
		1994 par Rasmus Lerdorf.  Il l'a con&ccedil;u pour surveiller les personnes qui venait
		consulter son CV en ligne.  La premi&egrave;re version est sortie au debut de l'ann&eacute;e
		1995, &agrave; ce moment Rasmus a pens&eacute; qu'en le distribuant sous licence Open Source,
		d'autres d&eacute;veloppeurs corrigerait les bugs. La premi&egrave;re version &eacute;tait tr&eacute;s
		simple et comprenait un parseur qui &eacute;tait capable de reconnaitre quelques 
		macros et fournissait quelques outils utiles pour les pages Web.
   </simpara>
   <simpara>
    Le parseur a &eacute;t&eacute; r&eacute;crit durant l'ann&eacute;e 1995 et a &eacute;t&eacute; renomm&eacute; PHP/FI version 2.
		"FI" signifie "Form Interpreter" (Interpr&eacute;teur de formulaire) qui a &eacute;t&eacute; ajout&eacute; 
		par Rasmus pour r&eacute;pondre au besoin grandissant des pages Web. Le support de 
		la base de donn&eacute;es mSQL a &eacute;t&eacute; ajout&eacute; &agrave; ce moment. PHP/FI est 
		devenu populaire et des d&eacute;veloppeurs ont commenc&eacute; &agrave; contribuer au d&eacute;veloppement
		en envoyant des morceaux de codes.
   </simpara>
   <simpara>
    En 1997, Zeev Suraski et Andi Gutmans ont r&eacute;&eacute;crit le parseur et PHP est pass&eacute;
		du projet de Rasmus &agrave; un projet de groupe. Cela a permis la cr&eacute;ation des bases
		de PHP3, qui se nomme maintenant PHP: Hypertext Preprocessor 
		(un acronyme r&eacute;cursif).
   </simpara>
   <simpara>
    La derni&egrave;re version, PHP4, est une nouvelle r&eacute;&eacute;criture du parseur par Suraski
		et Gutmans et est bas&eacute;s sur le moteur de script <ulink url="&url.zend;">Zend</ulink>.
		PHP est d&eacute;velopp&eacute;s par plus de 200 personnes du monde entier sur les diff&eacute;rentes
		parties du projet. Il y a des plus en plus de modules d'extensions pour supporter
		en natifs les serveurs les plus populaires, par exemple un support MySQL et 
		ODBC.
   </simpara>
   <simpara>
    Les derni&egrave;res statistiques montre que PHP est utilis&eacute; sur plus de 5.5 millions
		de domaines, et il progresse constatement. C'est aussi de loin le module 
		Apache le plus utilis&eacute;. Pour donner une id&eacute;e, Apache poss&egrave;de 60 % des parts
		de march&eacute; des serveurs Web, alors qu'IIS (le serveur Web de microsoft qui supporte
		nativement le langage ASP) repr&eacute;sente &agrave; peine 30%. 
    (Chiffres disponibles sur <ulink url="&url.stats;">&url.stats;</ulink>
    Mars 2001.)
   </simpara>
  </sect2>
  <sect2 id="intro.whatis.php.whatdoes">
   <title>A quoi sert PHP?</title>
   <simpara>
    PHP est un langage. il est g&eacute;n&eacute;ralement utilis&eacute; comme langage de script inclus
		dans les pages HTML pour utiliser sur le Web, mais on peut aussi l'utiliser
		comme langage de script ou alors pour &eacute;crire des applications graphiques 
		gr&acirc;ce &agrave; PHP-GTK.
   </simpara>
   <simpara>
    Comme PHP est un projet Open Source, Si il y a une chose que vous ne pouvez 
		pas faire avec PHP rien ne vous empeche d'&eacute;crire votre propre extension en C.
		Tout cela est possible gr&acirc;ce &agrave; une documentation tr&eacute;s compl&egrave;te de l'API PHP.
   </simpara>
   <para>
    PHP4 est divis&eacute;s en 2 parties:
    <itemizedlist>
     <listitem>
      <simpara>
       <emphasis>Le moteur Zend</emphasis>
      </simpara>
      <simpara>
       est la partie de PHP qui g&eacute;re les requ&ecirc;tes, les fichiers de scripts, 
			 les variables et les ressources du syst&egrave;me. Le site se trouve ici 
			 <ulink url="&url.zend;">&url.zend;</ulink>.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       <emphasis>PHP</emphasis>
      </simpara>
      <simpara>
       repr&eacute;sente 90% des fonctionnalit&eacute;s accessible par le d&eacute;veloppeur. cela 
			 repr&eacute;sente un grand nombre d'extensions comme MySQL, ODBC et XML.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
  </sect2>
 </sect1>

 <sect1 id="intro.acknowledgements">
  <title>PHP-GTK Remerciements</title>
  <simpara>
   La personne que j'aimerais remercier est James Henstridge
   <ulink url="mailto:&email.james.henstridge;">
    <email>&email.james.henstridge;</email></ulink>, l'auteur de PyGTK 
   (Extensions GTK+ pour Python).  Son aide et ses conseils ont &eacute;t&eacute; tr&eacute;s pr&eacute;cieux
	 duant le d&eacute;veloppement de cette extension, et une partie du source code est bas&eacute; 
	 ou inspir&eacute; de celui qu'il a d&eacute;velopp&eacute; pour PyGTK.
  </simpara>
  <simpara>
   Je voudrais aussi remercier la PHP Team pour avoir faire si formidable langage
	 ainsi que la Team GTK+ pour avoir d&eacute;velopp&eacute; la meilleure librairie C pour cr&eacute;er
	 des interfaces graphiques.
  </simpara>
  <simpara>
   <author>
    <firstname>Andrei</firstname><surname>Zmievski</surname>
   </author>
   - <literal>F&eacute;vrier 2001</literal>
  </simpara>
 </sect1>
</chapter>
